xhawk18/s_task/build/stm32f302/Libraries/STM32F30x_I2C_CPAL_Driver/src/stm32f30x_i2c_cpal.c
    /* If CPAL_OPT_I2C_NOSTOP_MODE is not selected */
    if ((pDevInitStruct->wCPAL_Options & CPAL_OPT_I2C_NOSTOP_MODE) == 0)
    {
      /* Wait until BUSY flag is reset */
      __CPAL_I2C_TIMEOUT(!(__CPAL_I2C_HAL_GET_BUSY(pDevInitStruct->CPAL_Dev)), CPAL_I2C_TIMEOUT_BUSY);
    }

    /* Update CPAL_State to CPAL_STATE_READY_RX */
    pDevInitStruct->CPAL_State = CPAL_STATE_READY_RX;
    CPAL_LOG("\n\rLOG : I2C Device Ready RX");

#ifdef CPAL_I2C_DMA_PROGMODEL
    /* If DMA programming model */
    if (pDevInitStruct->CPAL_ProgModel == CPAL_PROGMODEL_DMA)
    {
      /* Configure and enable RX DMA channel */
      I2C_Enable_DMA(pDevInitStruct, CPAL_DIRECTION_RX);
    }
#endif /* CPAL_I2C_DMA_PROGMODEL */

#ifdef CPAL_I2C_MASTER_MODE
    /* If master mode selected */
    if (pDevInitStruct->CPAL_Mode == CPAL_MODE_MASTER)
    {
  #ifdef CPAL_I2C_10BIT_ADDR_MODE
      /* If 10 Bit addressing mode */
      if (pDevInitStruct->pCPAL_I2C_Struct->I2C_AcknowledgedAddress == I2C_AcknowledgedAddress_10bit)
      {
        /* Enable 10Bit addressing mode */
        CR2_tmp |= I2C_CR2_ADD10;
      }
  #endif /* CPAL_I2C_10BIT_ADDR_MODE */

      /* Configure slave address */
      CR2_tmp |= (uint32_t)((pDevInitStruct->pCPAL_TransferRx->wAddr1) & 0x000003FF);
    }

  #ifdef CPAL_I2C_MEM_ADDR
    /* If No Memory Address option bit is not selected and master mode selected */
    if (((pDevInitStruct->wCPAL_Options & CPAL_OPT_NO_MEM_ADDR) == 0)
        && (pDevInitStruct->CPAL_Mode == CPAL_MODE_MASTER ))
    {
      CPAL_LOG("\n\rLOG : I2C Device Master Mem Addr Mode");

      /* Disable error interrupt to manage error without interrupt */
      __CPAL_I2C_HAL_DISABLE_ERRIT(pDevInitStruct->CPAL_Dev);
      
      /* If 8 Bit register mode */
      if ((pDevInitStruct->wCPAL_Options & CPAL_OPT_16BIT_REG) == 0)
      {
        /* Configure Nbytes */
        CR2_tmp |= (uint32_t)((uint32_t)(1) << 16);

        /* Update CR2 Register */
        __CPAL_I2C_HAL_CR2_UPDATE(pDevInitStruct->CPAL_Dev, CR2_tmp);

        /* Generate start */
        __CPAL_I2C_HAL_START(pDevInitStruct->CPAL_Dev);

         /* Wait until TXIS flag is set or NACK is set */
        __CPAL_I2C_TIMEOUT((__CPAL_I2C_HAL_GET_TXIS(pDevInitStruct->CPAL_Dev) || __CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev)), CPAL_I2C_TIMEOUT_TXIS);
       
        /* If acknowledge failure detected generate stop and abort communication */
        if (__CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev))
        {
          /* Generate stop if autoend option is disabled */
          if((CPAL_I2C_DEVICE[(pDevInitStruct->CPAL_Dev)]->CR2 & I2C_CR2_AUTOEND) != I2C_CR2_AUTOEND)
          {
            /* Generate stop */
            __CPAL_I2C_HAL_STOP(pDevInitStruct->CPAL_Dev);
          }
          
          /* Clear NACK flag */
          __CPAL_I2C_HAL_CLEAR_NACK(pDevInitStruct->CPAL_Dev);
          
          /* Wait until STOP flag is set */
          __CPAL_I2C_TIMEOUT(__CPAL_I2C_HAL_GET_STOP(pDevInitStruct->CPAL_Dev), CPAL_I2C_TIMEOUT_BUSY);
          
          /* Clear STOP flag */
          __CPAL_I2C_HAL_CLEAR_STOP(pDevInitStruct->CPAL_Dev);
          
          /* Update wCPAL_DevError */
          pDevInitStruct->wCPAL_DevError = CPAL_I2C_ERR_AF;
          
          /* Set CPAL_State to CPAL_STATE_ERROR */
          pDevInitStruct->CPAL_State = CPAL_STATE_ERROR;
                
          return CPAL_FAIL;
        }
        
        /* Send register address */
        __CPAL_I2C_HAL_SEND(pDevInitStruct->CPAL_Dev, (uint8_t)(pDevInitStruct->pCPAL_TransferRx->wAddr2));
      }
    #ifdef CPAL_16BIT_REG_OPTION
      /* If 16 Bit register mode */
      else
      {
        /* Configure Nbytes */
        CR2_tmp |= (uint32_t)((uint32_t)(2) << 16);

        /* Update CR2 Register */
        __CPAL_I2C_HAL_CR2_UPDATE(pDevInitStruct->CPAL_Dev, CR2_tmp);

        /* Generate start */
        __CPAL_I2C_HAL_START(pDevInitStruct->CPAL_Dev);

   /* Wait until TXIS flag is set or NACK is set */
        __CPAL_I2C_TIMEOUT((__CPAL_I2C_HAL_GET_TXIS(pDevInitStruct->CPAL_Dev) || __CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev)), CPAL_I2C_TIMEOUT_TXIS);
       
        /* If acknowledge failure detected generate stop and abort communication */
        if (__CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev))
        {
          /* Generate stop if autoend option is disabled */
          if((CPAL_I2C_DEVICE[(pDevInitStruct->CPAL_Dev)]->CR2 & I2C_CR2_AUTOEND) != I2C_CR2_AUTOEND)
          {
            /* Generate stop */
            __CPAL_I2C_HAL_STOP(pDevInitStruct->CPAL_Dev);
          }
          
          /* Clear NACK flag */
          __CPAL_I2C_HAL_CLEAR_NACK(pDevInitStruct->CPAL_Dev);
          
          /* Wait until STOP flag is set */
          __CPAL_I2C_TIMEOUT(__CPAL_I2C_HAL_GET_STOP(pDevInitStruct->CPAL_Dev), CPAL_I2C_TIMEOUT_BUSY);
          
          /* Clear STOP flag */
          __CPAL_I2C_HAL_CLEAR_STOP(pDevInitStruct->CPAL_Dev);
          
          /* Update wCPAL_DevError */
          pDevInitStruct->wCPAL_DevError = CPAL_I2C_ERR_AF;
          
          /* Set CPAL_State to CPAL_STATE_ERROR */
          pDevInitStruct->CPAL_State = CPAL_STATE_ERROR;
                
          return CPAL_FAIL;
        }

        /* Send register address (MSB) */
        __CPAL_I2C_HAL_SEND(pDevInitStruct->CPAL_Dev, (uint8_t)(((pDevInitStruct->pCPAL_TransferRx->wAddr2)& 0xFF00) >> 8));

       /* Wait until TXIS flag is set or NACK is set */
        __CPAL_I2C_TIMEOUT((__CPAL_I2C_HAL_GET_TXIS(pDevInitStruct->CPAL_Dev) || __CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev)), CPAL_I2C_TIMEOUT_TXIS);
       
        /* If acknowledge failure detected generate stop and abort communication */
        if (__CPAL_I2C_HAL_GET_NACK(pDevInitStruct->CPAL_Dev))
        {
          /* Generate stop if autoend option is disabled */
          if((CPAL_I2C_DEVICE[(pDevInitStruct->CPAL_Dev)]->CR2 & I2C_CR2_AUTOEND) != I2C_CR2_AUTOEND)
          {
            /* Generate stop */
            __CPAL_I2C_HAL_STOP(pDevInitStruct->CPAL_Dev);
          }
          
